package jp.co.mcc.nttdata.batch.business.com.cmABgdatB;

import jp.co.mcc.nttdata.batch.business.com.c_aplcom1.dto.StringDto;

/*   プログラム名       ： バッチ処理日付取得（cmABgdat.c）                   */
/*                                                                            */
/*   【処理概要】                                                             */
/*       バッチ処理日を標準出力に出力する。                                   */
/*                                                                            */
/*   【引数説明】                                                             */
/*      -DY  : 前日日付（任意）                                               */
/*      -DY2 : ２日前日付（任意）                                             */
/*      -DY3 : ３日前日付（任意）                                             */
/*      -DY4 : ４日前日付（任意）                                             */
/*      -DY5 : ５日前日付（任意）                                             */
/*      -DY6 : ６日前日付（任意）                                             */
/*      -DY7 : ７日前日付（任意）                                             */
/*      -DT  : 翌日日付（任意）                                               */
/*      -D2  : ２日後日付（任意）                                             */
/*      -D3  : ３日後日付（任意）                                             */
/*      -D4  : ４日後日付（任意）                                             */
/*      -D5  : ５日後日付（任意）                                             */
/*      -D6  : ６日後日付（任意）                                             */
/*      -D7  : ７日後日付（任意）                                             */
/*                                                                            */
/*   【戻り値】                                                               */
/*      10      ： 正常                                                       */
/*      99      ： 異常                                                       */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/*   稼働環境                                                                 */
/*      Red Hat Enterprise Linux 6（64bit）                                   */
/*      (文字コード ： UTF8)                                                  */
/*----------------------------------------------------------------------------*/
public interface CmABgdatBService {

    int getEnv(String p_key, StringDto p_val, int logflg); /* 環境変数取得      */
}
